import { Component, OnInit } from '@angular/core';
import { CommonModule } from '@angular/common';

interface Tip {
  title: string;
  description: string;
}

@Component({
  selector: 'app-medical-tips',
  standalone: true,
  imports: [CommonModule],
  templateUrl: './medical-tips.component.html',
  styleUrls: ['./medical-tips.component.scss']
})
export class MedicalTipsComponent implements OnInit {

  tips: Tip[] = [
    {
      title: 'شرب الماء بانتظام',
      description: 'حافظ على تناول كميات كافية من الماء طوال اليوم لترطيب الجسم وتنشيط الدورة الدموية.'
    },
    {
      title: 'تناول الفواكه والخضروات',
      description: 'احرص على تناول تشكيلة متنوعة من الفواكه والخضروات للحصول على الفيتامينات والمعادن الضرورية.'
    },
    {
      title: 'ممارسة الرياضة بانتظام',
      description: 'خصص وقتاً يومياً لممارسة النشاط البدني مثل المشي أو الجري أو تمارين القوة.'
    },
    {
      title: 'الحصول على قسط كافٍ من النوم',
      description: 'احرص على النوم لمدة 7-8 ساعات يومياً لتمكين الجسم من الاسترخاء والتجديد.'
    },
    {
      title: 'تجنب التدخين',
      description: 'الإقلاع عن التدخين يقلل من فرص الإصابة بالعديد من الأمراض المزمنة ويعزز الصحة العامة.'
    },
    {
      title: 'الحد من استهلاك الكحول',
      description: 'التقليل من تناول المشروبات الكحولية يساهم في تقليل المخاطر الصحية المرتبطة بها.'
    },
    {
      title: 'الحفاظ على الوزن المثالي',
      description: 'اتبع نظاماً غذائياً متوازناً ومارس النشاط البدني للحفاظ على وزن صحي.'
    },
    {
      title: 'تقليل تناول السكر والملح',
      description: 'حاول تقليل المنتجات الغنية بالسكر والملح لتجنب المشاكل الصحية مثل ارتفاع ضغط الدم والسكري.'
    },
    {
      title: 'متابعة الفحوصات الدورية',
      description: 'قم بعمل الفحوصات الطبية الدورية للكشف المبكر عن أي مشاكل صحية محتملة.'
    },
    {
      title: 'الحفاظ على النظافة الشخصية',
      description: 'اتباع عادات النظافة الشخصية يساهم في الوقاية من العديد من الأمراض المعدية.'
    },
    {
      title: 'إدارة التوتر والضغط النفسي',
      description: 'مارس تقنيات الاسترخاء مثل التنفس العميق أو التأمل لتخفيف الضغوط اليومية.'
    },
    {
      title: 'تناول وجبة إفطار صحية',
      description: 'ابدأ يومك بفطور متوازن يحتوي على البروتينات والحبوب والألياف لتحسين نشاطك اليومي.'
    },
    {
      title: 'تحسين الهضم بتناول الألياف',
      description: 'تناول الأطعمة الغنية بالألياف يحسن عملية الهضم ويقلل من مشاكل الجهاز الهضمي.'
    },
    {
      title: 'الابتعاد عن الوجبات السريعة',
      description: 'تجنب الوجبات السريعة للحفاظ على صحة الجهاز الهضمي والوزن المثالي.'
    },
    {
      title: 'استخدام المكملات الغذائية عند الحاجة',
      description: 'استشر طبيبك لتحديد الحاجة إلى المكملات الغذائية التي تدعم صحتك العامة.'
    },
    {
      title: 'الابتعاد عن المواد الكيميائية الضارة',
      description: 'قلل من التعرض للمواد الكيميائية في التنظيف والصناعات لتحمي جسمك من السموم.'
    },
    {
      title: 'الحفاظ على صحة الفم والأسنان',
      description: 'تنظيف الأسنان بانتظام وزيارة طبيب الأسنان يمنع مشكلات الفم واللثة.'
    },
    {
      title: 'ممارسة التأمل والاسترخاء',
      description: 'استخدم تقنيات التأمل والاسترخاء لتعزيز الصحة الذهنية والتقليل من التوتر.'
    },
    {
      title: 'تنظيم وقت الراحة والنشاط',
      description: 'وازن بين فترات العمل والراحة لتجنب الإرهاق وتحقيق إنتاجية أفضل.'
    },
    {
      title: 'استشارة الطبيب عند ظهور أعراض غير طبيعية',
      description: 'لا تتردد في مراجعة الطبيب فور ظهور أي أعراض غير معتادة للحصول على التشخيص المناسب.'
    },
    {
      title: 'تنظيم الوجبات',
      description: 'قسم وجباتك إلى وجبات صغيرة ومتوازنة خلال اليوم لضبط مستويات الطاقة والهضم.'
    },
    {
      title: 'حافظ على ممارسات النظافة في المطبخ',
      description: 'تأكد من غسل اليدين والأدوات جيداً قبل وبعد تحضير الطعام لتجنب التسمم الغذائي.'
    },
    {
      title: 'تخصيص وقت للنشاطات الاجتماعية',
      description: 'التواصل الاجتماعي يعزز الصحة النفسية ويقلل من مستويات التوتر والعزلة.'
    },
    {
      title: 'ممارسة الأنشطة الذهنية',
      description: 'قم بحل الألغاز، قراءة الكتب أو تعلم مهارات جديدة لتنشيط العقل وتقليل خطر التدهور العقلي.'
    },
    {
      title: 'تحديد وقت للاسترخاء الرقمي',
      description: 'قلل من استخدام الأجهزة الإلكترونية قبل النوم لتحسين جودة النوم والتقليل من إجهاد العينين.'
    },
    {
      title: 'الاستمتاع بالشمس بحذر',
      description: 'تعرض بشكل معتدل لأشعة الشمس للحصول على فيتامين د، ولكن احرص على حماية جلدك من الأشعة الضارة.'
    },
    {
      title: 'المحافظة على العلاقات الاجتماعية الصحية',
      description: 'تجنب العزلة وشارك في الأنشطة الاجتماعية لتحافظ على صحتك النفسية والجسدية.'
    },
    {
      title: 'اتباع نظام غذائي غني بالبروتين',
      description: 'تناول البروتين من مصادر متنوعة مثل اللحوم الخالية من الدهون، البيض، والأسماك لتعزيز صحة العضلات.'
    },
    {
      title: 'تناول الطعام ببطء',
      description: 'ابتعد عن تناول الطعام بسرعة وخصص وقتاً كافياً للاستمتاع بوجباتك لتجنب مشاكل الهضم.'
    },
    {
      title: 'إدارة وقت الشاشة للأطفال',
      description: 'قلل من الوقت الذي يقضيه الأطفال أمام الشاشات، وشجعهم على ممارسة الأنشطة البدنية.'
    },
    {
      title: 'الابتعاد عن المواد الحافظة',
      description: 'حاول تقليل تناول الأطعمة التي تحتوي على مواد حافظة ومواد كيميائية ضارة.'
    },
    {
      title: 'مراقبة مستويات الكوليسترول',
      description: 'راقب مستويات الكوليسترول في الدم من خلال فحص دوري واتباع نظام غذائي صحي.'
    },
    {
      title: 'التحكم في ضغط الدم',
      description: 'اتباع نظام غذائي منخفض الصوديوم وممارسة الرياضة بانتظام يساعد في الحفاظ على ضغط الدم ضمن المستويات الطبيعية.'
    },
    {
      title: 'تخصيص وقت للنوم الجيد',
      description: 'خصص وقتاً مناسباً للنوم ولا تفرط في العمل أو استخدام الأجهزة الإلكترونية قبل النوم.'
    },
    {
      title: 'التقليل من الإجهاد الذهني',
      description: 'مارس تقنيات التأمل واليوغا للتخفيف من التوتر الذهني وتحقيق توازن أفضل في حياتك.'
    },
    {
      title: 'الاهتمام بصحة العينين',
      description: 'استخدم نظارات شمسية لحماية عينيك من الأشعة فوق البنفسجية وراقب صحتها بانتظام.'
    },
    {
      title: 'حافظ على هويتك الشخصية',
      description: 'اعتنِ بالصحة النفسية وابتعد عن الضغوط النفسية التي قد تؤثر على شعورك بالراحة والانسجام.'
    },
    {
      title: 'تعلم أساليب جديدة للطبخ الصحي',
      description: 'جرب وصفات صحية جديدة تساعدك على تحسين نمط حياتك الغذائي.'
    },
    {
      title: 'الاستماع إلى جسدك',
      description: 'تعرف على إشارات جسمك ولا تتجاهل أي أعراض غير طبيعية قد تستدعي زيارة الطبيب.'
    },
    {
      title: 'تخصيص وقت للأنشطة الترفيهية',
      description: 'احرص على تخصيص وقت للأنشطة الترفيهية والرياضية التي تساهم في تعزيز صحتك الجسدية والنفسية.'
    },
    {
      title: 'المحافظة على عادات النظافة في العمل',
      description: 'نظف مكان عملك بشكل دوري وابتعد عن العادات التي قد تؤدي إلى انتشار الجراثيم.'
    },
    {
      title: 'الابتعاد عن الإفراط في تناول الكافيين',
      description: 'قلل من استهلاك المشروبات التي تحتوي على الكافيين مثل القهوة والشاي لتجنب الأرق وتحسين جودة النوم.'
    }
    
  ];

  constructor() { }

  ngOnInit(): void {
    // يمكنك إضافة أي منطق تهيئة إضافي هنا
  }
}
